import copy
from typing import List
# !/usr/bin/env python
# -*- coding: utf-8 -*-
# vim:fileencoding=utf-8

table1 = [
    ['', 'Выполнено', '+7 328 204-38-39', '17%', '17%'],
    ['', 'Не выполнено', '+7 304 166-11-08', '34%', '34%'],
    ['', 'Выполнено', '+7 567 381-63-27', '49%', '49%'],
    ['', 'Выполнено', '+7 114 834-24-90', '95%', '95%'],
]

table2 = [
    ['', 'Не выполнено', '+7 739 139‐97‐56', '40%', '40%'],
    ['', 'Не выполнено', '+7 459 456‐73‐63', '6%', '6%'],
    ['', 'Не выполнено', '+7 083 953‐25‐50', '11%', '11%'],
    ['', 'Выполнено', '+7 542 257‐17‐32', '80%', '80%']
]


def f23(table):
    a = [[], [], []]

    for array in table:
        if array[1] == 'Выполнено':
            a[0].append('Да')
        elif array[1] == 'Не выполнено':
            a[0].append('Нет')

        a[1].append(array[2].split(' ')[2].split('-')[0] + '-' + array[2].split(' ')[2].split('-')[1] +
                    array[2].split(' ')[2].split('-')[2])

        tmp0 = array[3].split('%')[0]
        tmp0 = int(tmp0) / 100
        a[2].append(str(round(tmp0, 1)))

    return a


print(f23([
    ['', 'Выполнено', '+7 328 204-38-39', '17%', '17%'],
    ['', 'Не выполнено', '+7 304 166-11-08', '34%', '34%'],
    ['', 'Выполнено', '+7 567 381-63-27', '49%', '49%'],
    ['', 'Выполнено', '+7 114 834-24-90', '95%', '95%']
]))


print(f23([
    ['', 'Не выполнено', '+7 739 139-97-56', '40%', '40%'],
    ['', 'Не выполнено', '+7 459 456-73-63', '6%', '6%'],
    ['', 'Не выполнено', '+7 083 953-25-50', '11%', '11%'],
    ['', 'Выполнено', '+7 542 257-17-32', '80%', '80%']
    ]
))

# Если сделать print, то выведет none , так как функция ничего не возвращает
# print(f23(table1))
# print(f23(table2))

# print(ord('‐'))